app/views/inheritors/_inheritors.html.erb

SELECT "inheritor_types".* FROM "inheritor_types" WHERE "inheritor_types"."id" = 2 LIMIT 1
---
					<td>
					  <%= InheritorType.find_by_id(inheritor.inheritor_type_id).label %>