app/views/operation_types/index.html.erb

SELECT "operation_types".* FROM "operation_types" WHERE "operation_types"."service_id" = $1 ORDER BY name  [["service_id", 2]]
---
                    <ul class = "the-icons">
                      <% @operation_types = service.operation_types.order("name") %>