app/views/banks/_banks.html.erb

SELECT "bank_types".* FROM "bank_types" WHERE "bank_types"."id" = 1 LIMIT 1
---
					<td>
					  <%= BankType.find_by_id(bank.bank_type_id).name %>