app/controllers/banks_controller.rb

  def index
    @bank_types = BankType.where("published IS NOT FALSE").order("name ASC")
    @banks = Bank.all.order("name ASC").page(params[:page]).per_page(17)
---
SELECT "bank_types".* FROM "bank_types" WHERE (published IS NOT FALSE) ORDER BY name ASC
SELECT "banks".* FROM "banks" ORDER BY name ASC LIMIT 17 OFFSET 0