app/controllers/inheritors_controller.rb

SELECT "inheritor_types".* FROM "inheritor_types" WHERE (published IS NOT FALSE) ORDER BY label ASC
SELECT "inheritors".* FROM "inheritors" ORDER BY name ASC LIMIT 17 OFFSET 0
SELECT COUNT(*) FROM "inheritors"
---
  def index
    @inheritors_types = InheritorType.where("published IS NOT FALSE").order("label ASC")
    @inheritors = Inheritor.all.order("name ASC").page(params[:page]).per_page(17)