app/controllers/operation_types_controller.rb

SELECT "services".* FROM "services" ORDER BY name ASC LIMIT 17 OFFSET 0
---
  def index
    @service_idcss = @operation_type_namecss = @type_css = @commentcss = "row-form"
    @services = Service.all.order("name ASC").page(params[:page]).per_page(17)