app/controllers/payment_way_fees_controller.rb

  def index
    @namecss = @feecss = "row-form"
    @payment_ways = PaymentWayFee.all.order("name ASC").page(params[:page]).per_page(17)
---
SELECT "payment_way_fees".* FROM "payment_way_fees" ORDER BY name ASC LIMIT 17 OFFSET 0

  def edit
    @payment_way = PaymentWayFee.find_by_id(params[:id])
    @feecss = "row-form"
    @payment_ways = PaymentWayFee.all.order("name ASC").page(params[:page]).per_page(17)
---
SELECT "payment_way_fees".* FROM "payment_way_fees" WHERE "payment_way_fees"."id" = 7 LIMIT 1
SELECT "payment_way_fees".* FROM "payment_way_fees" ORDER BY name ASC LIMIT 17 OFFSET 0