app/controllers/services_controller.rb

SELECT "compensations".* FROM "compensations" WHERE (published IS NOT FALSE) ORDER BY cuid ASC
SELECT "services".* FROM "services" ORDER BY name ASC LIMIT 17 OFFSET 0
---
  def index
    @compensations = Compensation.where("published IS NOT FALSE").order("cuid ASC")
    @services = Service.all.order("name ASC").page(params[:page]).per_page(17)