app/controllers/transactions_controller.rb

  def index
    @services = Service.all.order("name ASC").page(params[:page]).per_page(17)
---
SELECT "services".* FROM "services" ORDER BY name ASC LIMIT 17 OFFSET 0

  def list_per_service
    @service = Service.find_by_id(params[:id])
---
SELECT "services".* FROM "services" WHERE "services"."id" = 2 LIMIT 1